public/Simulation-Plan.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-14 Sun 21:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Vision Simulation Plan</title>
<meta name="author" content="Lawrence Qupty" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Vision Simulation Plan</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org45924da">1. Goals</a>
<ul>
<li><a href="#org33520bc">1.1. Overall utility</a></li>
<li><a href="#orgb33a507">1.2. Token distribution</a></li>
<li><a href="#org068acbc">1.3. Deflation</a></li>
<li><a href="#org3515c60">1.4. User growth</a></li>
</ul>
</li>
<li><a href="#orge74c6e7">2. Methods</a></li>
</ul>
</div>
</div>

<div id="outline-container-org45924da" class="outline-2">
<h2 id="org45924da"><span class="section-number-2">1.</span> Goals</h2>
<div class="outline-text-2" id="text-1">
<p>
Simulating Vision tokenomics enables understanding of the potential utility of the platform, including which of Vision's features are the most useful, and which revenue streams have the greatest potential to scale.
</p>

<p>
We will collect data on the following:
</p>

<ul class="org-ul">
<li>Overall utility</li>
<li>Token distribution</li>
<li>Deflation</li>
<li>User growth</li>
</ul>
</div>

<div id="outline-container-org33520bc" class="outline-3">
<h3 id="org33520bc"><span class="section-number-3">1.1.</span> Overall utility</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<b>Overall utility</b>, in an abstract sense, is how much Vision users gain and lose.
</p>

<p>
To understand overall utility, we will collect market efficiency data on various file storage systems, as an effective file storage system is crucial for a decentralized service like Vision. We will also investigate how Vision handles various levels of voter fraud and the abilities of the Enforcer-jury model.
</p>

<p>
Specific data points may include:
</p>

<ul class="org-ul">
<li>Deadweight loss (in the storage pricing market) due to staking</li>
<li>Deadweight loss when there are no security measures</li>
<li>Slashing rate</li>
<li>Enforcer-jury model false positive rate</li>
<li>Enforcer-jury false negative rate</li>
</ul>
</div>
</div>

<div id="outline-container-orgb33a507" class="outline-3">
<h3 id="orgb33a507"><span class="section-number-3">1.2.</span> Token distribution</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<b>Token distribution</b> is a measure of the movement and ownership of <code>VIS</code>. Understanding token distribution allows us to answer questions like "Do people want to buy <code>VIS</code>?" and "Who has control over Vision?"
</p>

<p>
Specific data points may include:
</p>

<ul class="org-ul">
<li>Distribution of <code>VIS</code> among all users</li>
<li>A statistically random user's chance to buy <code>VIS</code></li>
<li>Average user's volume of <code>VIS</code></li>
</ul>
</div>
</div>

<div id="outline-container-org068acbc" class="outline-3">
<h3 id="org068acbc"><span class="section-number-3">1.3.</span> Deflation</h3>
<div class="outline-text-3" id="text-1-3">
<p>
<b>Deflation</b> reflects how much <code>VIS</code> gets burned. Our goal is to understand which policies lead to the most advantageous amount of deflation for maximum user utility.
</p>

<p>
Specific data points may include:
</p>

<ul class="org-ul">
<li>Volume of <code>VIS</code> burned</li>
<li>Which user actions lead to <code>VIS</code> being burned</li>
<li>Market changes due to the value of <code>VIS</code> changing. For example, the supply of storage in the pinning market.</li>
</ul>
</div>
</div>

<div id="outline-container-org3515c60" class="outline-3">
<h3 id="org3515c60"><span class="section-number-3">1.4.</span> User growth</h3>
<div class="outline-text-3" id="text-1-4">
<p>
<b>User growth</b> tells us how much utility is needed to attract or deter users from Vision. The data being collected under this category will be compared to metrics from the other categories, such as the file storage information from <a href="#org33520bc">1.1</a>. 
</p>

<p>
Specific data points may include:
</p>

<ul class="org-ul">
<li>Chance a user is discouraged or encouraged to use Vision given the deadweight loss in the storage pricing market</li>
<li>Chance a user is discouraged or encouraged to use Vision given the value of VIS</li>
<li>Chance a user is discouraged or encouraged to use Vision given how centralized/decentralized the distribution of VIS is.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orge74c6e7" class="outline-2">
<h2 id="orge74c6e7"><span class="section-number-2">2.</span> Methods</h2>
<div class="outline-text-2" id="text-2">
<p>
The methods used to simulate Vision's tokenomics will use simulation methods such as Monte Carlo via radCad (a sort of successor to cadCad) combined with statistical analysis methods such as Bayesian inference.
</p>

<p>
We include different simulation layers for each data category listed in the <a href="#org45924da">1</a> section. These layers can be combined to strengthen predictive power. This makes it possible to extend the simulation as more data gets provided from live Vision tests (such as Testnet) or elsewhere.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>Data Category</b></th>
<th scope="col" class="org-left"><b>Notes</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Overall Utility</td>
<td class="org-left">Measures the markets inside Vision.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Token Distribution</td>
<td class="org-left">Measures how users interact with the VIS token.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Deflation</td>
<td class="org-left">Measures properties of VIS token itself.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">User Growth</td>
<td class="org-left">Measures how useful Vision features are for users.</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2022-08-03 Wed 00:00</p>
<p class="author">Author: Lawrence Qupty</p>
<p class="date">Created: 2022-08-14 Sun 21:01</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
